{
  "_name_or_path": "yiyanghkust/finbert-tone",
  "architectures": [
    "BertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "O",
    "1": "B-DATE",
    "2": "B-EVENT",
    "3": "B-GPE",
    "4": "B-INSTRUMENT",
    "5": "B-METRIC",
    "6": "B-MONEY",
    "7": "B-ORG",
    "8": "B-PERCENT",
    "9": "B-PERSON",
    "10": "B-PRODUCT",
    "11": "B-TICKER",
    "12": "I-DATE",
    "13": "I-EVENT",
    "14": "I-GPE",
    "15": "I-INSTRUMENT",
    "16": "I-METRIC",
    "17": "I-MONEY",
    "18": "I-ORG",
    "19": "I-PERCENT",
    "20": "I-PERSON",
    "21": "I-PRODUCT",
    "22": "I-TICKER"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "B-DATE": 1,
    "B-EVENT": 2,
    "B-GPE": 3,
    "B-INSTRUMENT": 4,
    "B-METRIC": 5,
    "B-MONEY": 6,
    "B-ORG": 7,
    "B-PERCENT": 8,
    "B-PERSON": 9,
    "B-PRODUCT": 10,
    "B-TICKER": 11,
    "I-DATE": 12,
    "I-EVENT": 13,
    "I-GPE": 14,
    "I-INSTRUMENT": 15,
    "I-METRIC": 16,
    "I-MONEY": 17,
    "I-ORG": 18,
    "I-PERCENT": 19,
    "I-PERSON": 20,
    "I-PRODUCT": 21,
    "I-TICKER": 22,
    "O": 0
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "torch_dtype": "float32",
  "transformers_version": "4.44.0",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 30873
}
